# -*- coding: utf-8 -*-
"""
Created on Fri Nov 15 14:09:08 2024

@author: Xintang Zheng

星星: ★ ☆ ✪ ✩ 🌟 ⭐ ✨ 🌠 💫 ⭐️
勾勾叉叉: ✓ ✔ ✕ ✖ ✅ ❎
报警啦: ⚠ ⓘ ℹ ☣
箭头: ➔ ➜ ➙ ➤ ➥ ↩ ↪
emoji: 🔔 ⏳ ⏰ 🔒 🔓 🛑 🚫 ❗ ❓ ❌ ⭕ 🚀 🔥 💧 💡 🎵 🎶 🧭 📅 🤔 🧮 🔢 📊 📈 📉 🧠 📝

"""
# %%
index_mapping = {
    'hs300': '000300',
    'kc50': '000688',
    'sz50': '000016',
    'zz500': '000905',
    'zz1000': '000852',
    'zz2000': '932000', # '000984'
    'gz2000': '000985',
    'zzqz': '000985',
    }


index_to_futures = {
    '000852': 'IM',
    '000905': 'IC',
    '000300': 'IF',
    '000016': 'IH',
    }

INDEX_ALL = 'zzqz'
INDEX_SEQ = ['sz50', 'hs300', 'zz500', 'zz1000', 'zz2000']